#Область ОбработчикиСобытий

&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	КаталогКонсоли = "bsl_console";
	Путь = ПолучитьРодительскийКаталог();

	Результат = Ждать НайтиФайлыАсинх(Путь, "*", Истина);
	Для Каждого Каталог Из Результат Цикл
		Попытка
			Если Каталог.ЭтоКаталог() И КаталогКонсоли = Каталог.Имя Тогда
				УдалитьФайлы(Каталог.ПолноеИмя);
				Сообщение = СтрШаблон("Удален каталог %1", Каталог.ПолноеИмя);
				Сообщить(Сообщение);
			КонецЕсли;
		Исключение
			Сообщение = СтрШаблон("Не удалось обработать %1", Каталог.ПолноеИмя);
			Сообщить(Сообщение);
		КонецПопытки;
	КонецЦикла
	;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Функция ПолучитьРодительскийКаталог()

	Результат = Ждать КаталогВременныхФайловАсинх();
	Путь = Лев(Путь, СтрДлина(Путь) - 1);
	ПозицияПоследнегоСлеша = СтрНайти(Путь, "\", НаправлениеПоиска.СКонца);

	Если ПозицияПоследнегоСлеша > 0 Тогда
		Возврат Лев(Путь, ПозицияПоследнегоСлеша);
	Иначе
		Возврат Путь;
	КонецЕсли;
КонецФункции

#КонецОбласти