#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок			= Параметры.Заголовок;
	конс_НачальныйКод	= Параметры.Код;

	конс_ИнициализацияРедактораСервер.ПриСозданииНаСервере(ЭтотОбъект, Истина);

	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		ЭтотОбъект.конс_РежимПросмотра = Параметры.ТолькоПросмотр;
	КонецЕсли;

	Если Параметры.Свойство("ИмяФункции") Тогда
		ЭтотОбъект.конс_ИмяФункцииПерехода = Параметры.ИмяФункции;
	КонецЕсли;

	Доступность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	конс_ИнициализацияРедактораКлиент.ПриОткрытии(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура конс_НачальноеЗаполнение() Экспорт

	конс_КомандыРедактораКлиент.ОчиститьТекст(ЭтотОбъект);
	конс_КомандыРедактораКлиент.УстановитьТекст(ЭтотОбъект, конс_НачальныйКод, Неопределено, Ложь);

	Если ЭтотОбъект.конс_РежимПросмотра Тогда
		ЭтотОбъект.конс_ТолькоДляЧтения = Истина;
		конс_КомандыРедактораКлиент.УстановитьРежимТолькоДляЧтения(ЭтотОбъект, Истина);
		Элементы.конс_ТолькоДляЧтения.Пометка = Ложь;
		Элементы.конс_КонструкторЗапроса.Доступность = Ложь;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтотОбъект.конс_ИмяФункцииПерехода) Тогда
		конс_КомандыРедактораКлиент.View(ЭтотОбъект).goToFuncDefinition(ЭтотОбъект.конс_ИмяФункцииПерехода);
	КонецЕсли;

	Доступность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйДокументСформирован(Элемент)

	конс_ИнициализацияРедактораКлиент.ДокументСформирован(Элемент, ЭтотОбъект);
	конс_НачальноеЗаполнение();

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	конс_КомандыРедактораКлиент.ОбработатьСобытиеСУчетомРежимаЧтения(ЭтотОбъект, ДанныеСобытия.Event.eventData1C);

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйБазовыеКоманды(Команда)

	конс_КомандыРедактораКлиент.ВыполнитьБазовуюКоманду(ЭтотОбъект, Команда);

КонецПроцедуры

&НаКлиенте
Процедура конс_СохранитьИЗакрыть(Команда)

	Текст = конс_КомандыРедактораКлиент.ПолучитьТекст(ЭтотОбъект);
	Закрыть(Текст);

КонецПроцедуры

#КонецОбласти