#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок			= Параметры.Заголовок;
	конс_НачальныйКод	= Параметры.Код;
	конс_HTML			= Параметры.конс_HTML;

	конс_ИнициализацияРедактораСервер.ПриСозданииНаСервере(ЭтотОбъект);

	Доступность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЭтотОбъект.конс_ДокументЗагружен	= Истина;
	ЭтотОбъект.конс_ИсходникиЗагружены	= Истина;

	ПодключитьОбработчикОжидания("конс_НачальноеЗаполнение", 2, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	конс_ИнициализацияРедактораКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения,
		СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура конс_НачальноеЗаполнение() Экспорт

	конс_КомандыРедактораКлиент.ОчиститьТекст(ЭтотОбъект);
	конс_КомандыРедактораКлиент.УстановитьТекст(ЭтотОбъект, конс_НачальныйКод, Неопределено, Ложь);

	Доступность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура конс_ОбновитьСписокОбщихМодулей()

	КоллекцияМетаданных = ПолучитьИзВременногоХранилища(ЭтотОбъект.конс_АдресОбщихМодулей);

	Если КоллекцияМетаданных <> Неопределено Тогда
		конс_КомандыРедактораКлиент.View(ЭтотОбъект).updateMetadata(КоллекцияМетаданных,
			"commonModules.items");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйДокументСформирован(Элемент)

	Если ЭтотОбъект.конс_ИсходникиЗагружены Тогда
		конс_ИнициализацияРедактораКлиент.ДокументСформирован(Элемент, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	Если Не ЭтотОбъект.конс_ТолькоДляЧтения Тогда
		конс_КомандыРедактораКлиент.ОбработатьСобытиеРедактора(ЭтотОбъект, ДанныеСобытия.Event.eventData1C);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура конс_КонструкторЗапроса(Команда)

	конс_КомандыРедактораКлиент.ВызватьКонструкторЗапроса(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_ТолькоДляЧтения(Команда)

	конс_КомандыРедактораКлиент.ТолькоДляЧтения(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_БыстрыеПодсказки(Команда)

	конс_КомандыРедактораКлиент.БыстрыеПодсказки(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодсвечиватьЗапросы(Команда)

	конс_КомандыРедактораКлиент.ПодсвечиватьЗапросы(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_СтрокаСостояния(Команда)

	конс_КомандыРедактораКлиент.СтрокаСостояния(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_СохранитьИЗакрыть(Команда)

	Текст = конс_ИнициализацияРедактораКлиент.ПолучитьТекст(ЭтотОбъект);
	Закрыть(Текст);

КонецПроцедуры

#КонецОбласти