#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок			= Параметры.Заголовок;
	конс_НачальныйКод	= Параметры.Код;
	конс_HTML			= Параметры.конс_HTML;

	конс_ИнициализацияРедактораСервер.ПриСозданииНаСервере(ЭтотОбъект);

	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		ЭтотОбъект.конс_РежимПросмотра = Параметры.ТолькоПросмотр;
	КонецЕсли;

	Если Параметры.Свойство("ИмяФункции") Тогда
		ЭтотОбъект.конс_ИмяФункцииПерехода = Параметры.ИмяФункции;
	КонецЕсли;

	Доступность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЭтотОбъект.конс_ДокументЗагружен	= Истина;
	ЭтотОбъект.конс_ИсходникиЗагружены	= Истина;
	ЭтотОбъект.конс_СовременныеВозможности = Истина;

	ПодключитьОбработчикОжидания("конс_НачальноеЗаполнение", 2, Истина);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Ждать конс_ИнициализацияРедактораКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения,
		СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура конс_НачальноеЗаполнение() Экспорт

	конс_КомандыРедактораКлиент.ОчиститьТекст(ЭтотОбъект);
	конс_КомандыРедактораКлиент.УстановитьТекст(ЭтотОбъект, конс_НачальныйКод, Неопределено, Ложь);
	конс_КомандыРедактораКлиент.СовременныеВозможностиMonaco(ЭтотОбъект, ЭтотОбъект.конс_СовременныеВозможности);
	Элементы.конс_СовременныеВозможности.Пометка = ЭтотОбъект.конс_СовременныеВозможности;

	Если ЭтотОбъект.конс_РежимПросмотра Тогда
		ЭтотОбъект.конс_ТолькоДляЧтения = Истина;
		конс_КомандыРедактораКлиент.УстановитьРежимТолькоДляЧтения(ЭтотОбъект, Истина);
		Элементы.конс_ТолькоДляЧтения.Пометка = Ложь;
		Элементы.конс_КонструкторЗапроса.Доступность = Ложь;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтотОбъект.конс_ИмяФункцииПерехода) Тогда
		конс_КомандыРедактораКлиент.View(ЭтотОбъект).goToFuncDefinition(ЭтотОбъект.конс_ИмяФункцииПерехода);
	КонецЕсли;

	Доступность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура конс_ОбновитьСписокОбщихМодулей()

	КоллекцияМетаданных = ПолучитьИзВременногоХранилища(ЭтотОбъект.конс_АдресОбщихМодулей);

	Если КоллекцияМетаданных <> Неопределено Тогда
		конс_КомандыРедактораКлиент.View(ЭтотОбъект).updateMetadata(КоллекцияМетаданных,
			"commonModules.items");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйДокументСформирован(Элемент)

	Если ЭтотОбъект.конс_ИсходникиЗагружены Тогда
		конс_ИнициализацияРедактораКлиент.ДокументСформирован(Элемент, ЭтотОбъект);
	Иначе
		конс_ИнициализацияРедактораКлиент.ЗапланироватьПовторнуюИнициализацию(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура конс_ПовторИнициализацииКонсоли()

	конс_ИнициализацияРедактораКлиент.ПовторИнициализацииКонсоли(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	конс_КомандыРедактораКлиент.ОбработатьСобытиеСУчетомРежимаЧтения(ЭтотОбъект, ДанныеСобытия.Event.eventData1C);

КонецПроцедуры

&НаКлиенте
Процедура конс_КонструкторЗапроса(Команда)

	конс_КомандыРедактораКлиент.ВызватьКонструкторЗапроса(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_ТолькоДляЧтения(Команда)

	конс_КомандыРедактораКлиент.ТолькоДляЧтения(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_БыстрыеПодсказки(Команда)

	конс_КомандыРедактораКлиент.БыстрыеПодсказки(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодсвечиватьЗапросы(Команда)

	конс_КомандыРедактораКлиент.ПодсвечиватьЗапросы(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_СтрокаСостояния(Команда)

	конс_КомандыРедактораКлиент.СтрокаСостояния(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_СовременныеВозможности(Команда)

	ЭтотОбъект.конс_СовременныеВозможности = Не ЭтотОбъект.конс_СовременныеВозможности;
	Элементы.конс_СовременныеВозможности.Пометка = ЭтотОбъект.конс_СовременныеВозможности;
	конс_КомандыРедактораКлиент.СовременныеВозможностиMonaco(ЭтотОбъект, ЭтотОбъект.конс_СовременныеВозможности);

КонецПроцедуры

&НаКлиенте
Процедура конс_СохранитьИЗакрыть(Команда)

	Текст = конс_КомандыРедактораКлиент.ПолучитьТекст(ЭтотОбъект);
	Закрыть(Текст);

КонецПроцедуры

#КонецОбласти