
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Заголовок	= Параметры.Заголовок;
	конс_НачальныйКод		= Параметры.Код;
	конс_HTML				= Параметры.конс_HTML;

	конс_ОбщийМодульСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтотОбъект.конс_ДокументЗагружен	= Истина;
	ЭтотОбъект.конс_ИсходникиЗагружены	= Истина;

	ПодключитьОбработчикОжидания("конс_НачальноеЗаполнение", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	конс_ОбщийМодульКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура конс_НачальноеЗаполнение() Экспорт
	
	конс_ОбщийМодульКлиент.ОчиститьТекст(ЭтотОбъект);
	конс_ОбщийМодульКлиент.УстановитьТекст(ЭтотОбъект, конс_НачальныйКод, Неопределено, Ложь);
	
	Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура конс_ОбновитьСписокОбщихМодулей()
	
	КоллекцияМетаданных = ПолучитьИзВременногоХранилища(ЭтотОбъект.конс_АдресОбщихМодулей);
	
	Если КоллекцияМетаданных <> Неопределено Тогда
		Результат = конс_ОбщийМодульКлиент.View(ЭтотОбъект).updateMetadata(КоллекцияМетаданных, "commonModules.items");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйДокументСформирован(Элемент)
	
	Если ЭтотОбъект.конс_ИсходникиЗагружены Тогда
		конс_ОбщийМодульКлиент.ДокументСформирован(Элемент, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если НЕ ЭтотОбъект.конс_ТолькоДляЧтения Тогда
		конс_ОбщийМодульКлиент.ОбработатьСобытиеРедактора(ЭтотОбъект, ДанныеСобытия.Event.eventData1C);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура конс_КонструкторЗапроса(Команда)
	
	конс_ОбщийМодульКлиент.ВызватьКонструкторЗапроса(ЭтотОбъект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура конс_ТолькоДляЧтения(Команда)
	
	конс_ОбщийМодульКлиент.ТолькоДляЧтения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура конс_БыстрыеПодсказки(Команда)
	
	конс_ОбщийМодульКлиент.БыстрыеПодсказки(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура конс_ПодсвечиватьЗапросы(Команда)
	
	конс_ОбщийМодульКлиент.ПодсвечиватьЗапросы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура конс_СтрокаСостояния(Команда)
	
	конс_ОбщийМодульКлиент.СтрокаСостояния(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура конс_СохранитьИЗакрыть(Команда)
	
	Текст = конс_ОбщийМодульКлиент.ПолучитьТекст(ЭтотОбъект);
	Закрыть(Текст);
	
КонецПроцедуры

#КонецОбласти

