
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	конс_ИнициализацияРедактораСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	конс_ИнициализацияРедактораКлиент.ПриОткрытии(ЭтотОбъект);
	
	УстановитьВидимостьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	конс_ИнициализацияРедактораКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения,
		СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Объект.конс_Код = конс_КомандыРедактораКлиент.ПолучитьТекст(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура конс_ПодключаемыйДокументСформирован(Элемент)

	Если ЭтотОбъект.конс_ИсходникиЗагружены Тогда
		ПодключитьОбработчикОжидания("конс_ИнициализироватьДокумент", 1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	Если Не ЭтотОбъект.конс_ТолькоДляЧтения Тогда
		конс_КомандыРедактораКлиент.ОбработатьСобытиеРедактора(ЭтотОбъект, ДанныеСобытия.Event.eventData1C);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура конс_КонструкторЗапроса(Команда)

	конс_КомандыРедактораКлиент.ВызватьКонструкторЗапроса(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_ТолькоДляЧтения(Команда)

	конс_КомандыРедактораКлиент.ТолькоДляЧтения(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_БыстрыеПодсказки(Команда)

	конс_КомандыРедактораКлиент.БыстрыеПодсказки(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодсвечиватьЗапросы(Команда)

	конс_КомандыРедактораКлиент.ПодсвечиватьЗапросы(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_СтрокаСостояния(Команда)

	конс_КомандыРедактораКлиент.СтрокаСостояния(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура конс_СохранитьИЗакрыть(Команда)

	Текст = конс_КомандыРедактораКлиент.ПолучитьТекст(ЭтотОбъект);
	Закрыть(Текст);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	Элементы.конс_ТолькоДляЧтения.Пометка = Не ЭтотОбъект.конс_ТолькоДляЧтения;
	Элементы.конс_СтрокаСостояния.Пометка = ЭтотОбъект.конс_ВидимостьСтрокиСостояния;
	Элементы.конс_БыстрыеПодсказки.Пометка = ЭтотОбъект.конс_БыстрыеПодсказки;
	Элементы.конс_ПодсвечиватьЗапросы.Пометка = ЭтотОбъект.конс_ПодсвечиватьЗапросы;

КонецПроцедуры

&НаКлиенте
Процедура конс_ИнициализироватьДокумент()
	конс_ИнициализацияРедактораКлиент.ДокументСформирован(Элементы.конс_Код, ЭтотОбъект);
	конс_НачальноеЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура конс_НачальноеЗаполнение()

	конс_ОбновитьСписокОбщихМодулей();
	
	конс_КомандыРедактораКлиент.УстановитьТекст(ЭтотОбъект, Объект.конс_Код, Неопределено, Ложь);
	
	Доступность = ЭтотОбъект.конс_ДокументЗагружен;
	
КонецПроцедуры

&НаКлиенте
Процедура конс_ОбновитьСписокОбщихМодулей()
	
	КоллекцияМетаданных = ПолучитьИзВременногоХранилища(ЭтотОбъект.конс_АдресОбщихМодулей);
	
	конс_КомандыРедактораКлиент.View(ЭтотОбъект).clearMetadata();
	Если КоллекцияМетаданных <> Неопределено Тогда
		Результат = конс_КомандыРедактораКлиент.View(ЭтотОбъект).updateMetadata(КоллекцияМетаданных, "commonModules.items");
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

