
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	конс_ИнициализацияРедактораСервер.ПриСозданииНаСервере(ЭтотОбъект, Истина);
	
	СоответствияКодовНаСтранице = конс_ЗаполнитьСоответствияРазделовКода();
	
	ЭтотОбъект.конс_СоответствияКодовНаСтранице	= СоответствияКодовНаСтранице;
	ЭтотОбъект.конс_КлючАктивнойСтраницы		= "ГруппаПерваяСтраница";

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	конс_ИнициализацияРедактораКлиент.ПриОткрытии(ЭтотОбъект);

	УстановитьВидимостьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	конс_ИнициализацияРедактораКлиент.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	конс_СохранитьКодИзКонсоли(ТекущийОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	конс_ВкладкаНажатие(ТекущаяСтраница);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВкладкаНажатие(Элемент)

	// ВстраиваниеКонсолиMonaco
	ОтрисовкаИзмененияВкладки(Элемент);
	// Конец ВстраиваниеКонсолиMonaco

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйДокументСформирован(Элемент)

	конс_ИнициализацияРедактораКлиент.ДокументСформирован(Элементы.конс_Код, ЭтотОбъект);
	конс_НачальноеЗаполнение();

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	конс_КомандыРедактораКлиент.ОбработатьСобытиеСУчетомРежимаЧтения(ЭтотОбъект, ДанныеСобытия.Event.eventData1C);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыЗапроса

&НаКлиенте
Процедура конс_ПараметрыЗапросаКодЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", ТекущиеДанные.Имя);
	ПараметрыФормы.Вставить("Код", ТекущиеДанные.КодЗначение);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("конс_КодДо", конс_КомандыРедактораКлиент.ПолучитьТекст(ЭтотОбъект));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("конс_ПравилоЗаполненияЗавершение", ЭтотОбъект, ДопПараметры);
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму("ОбщаяФорма.конс_РедактированиеКода", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, , ,
		ОписаниеОповещения, РежимОткрытия);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьГруппыОставивРедакторКода(Команда)

	ТолькоРедактор = Не ТолькоРедактор;
	
	Если ТолькоРедактор Тогда
		Элементы.ГруппаШапкаСтраницы.Скрыть();
	Иначе
		Элементы.ГруппаШапкаСтраницы.Показать();
	КонецЕсли;
	
	Элементы.ГруппаЭмуляцияВкладок.Видимость = ТолькоРедактор;
	Элементы.ФормаСвернутьГруппыОставивРедакторКода.Пометка = ТолькоРедактор;

КонецПроцедуры

&НаКлиенте
Процедура конс_ЗаполнитьПараметрыЗапроса(Команда)

	ТекстЗапроса = конс_КомандыРедактораКлиент.ПолучитьТекст(ЭтотОбъект);
	конс_ЗаполнитьПараметрыЗапросаНаСервере(ТекстЗапроса);

КонецПроцедуры

&НаКлиенте
Процедура конс_ПодключаемыйБазовыеКоманды(Команда)

	конс_КомандыРедактораКлиент.ВыполнитьБазовуюКоманду(ЭтотОбъект, Команда);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	Элементы.ГруппаЭмуляцияВкладок.Видимость = ТолькоРедактор;
	Элементы.конс_ТолькоДляЧтения.Пометка = Не ЭтотОбъект.конс_ТолькоДляЧтения;
	Элементы.конс_СтрокаСостояния.Пометка = ЭтотОбъект.конс_ВидимостьСтрокиСостояния;
	Элементы.конс_БыстрыеПодсказки.Пометка = ЭтотОбъект.конс_БыстрыеПодсказки;
	Элементы.конс_ПодсвечиватьЗапросы.Пометка = ЭтотОбъект.конс_ПодсвечиватьЗапросы;

КонецПроцедуры

&НаКлиенте
Процедура конс_УстановитьВидимость(ЕстьКодНаСтранице)

	ВключитьДоступность = Ложь;
	Если ЕстьКодНаСтранице Тогда
		ВключитьДоступность = Истина;
	КонецЕсли;
	Элементы.конс_ГруппаКонсоли.Доступность = ВключитьДоступность;
	
	ВключитьРежимЗапроса =  ЭтотОбъект.конс_КлючАктивированнойСтраницы = "ГруппаВтораяСтраница";
	
	ТекстСообщения = СтрШаблон("Режим запроса при смене страницы: %1", Формат(ВключитьРежимЗапроса,
		"БЛ=отключен; БИ=включен;"));
	
	//@skip-check use-non-recommended-method
	Сообщить(ТекстСообщения);
	
	конс_КомандыРедактораКлиент.ПереключитьРежимЗапроса(ЭтотОбъект, ВключитьРежимЗапроса);

КонецПроцедуры

&НаСервере
Функция конс_ЗаполнитьСоответствияРазделовКода()

	СоответствияКодовНаСтранице = Новый Структура;
	
	СоответствиеРеквизитов = Новый Структура;
	СоответствиеРеквизитов.Вставить("Реквизит", "КодПервойСтраницы");
	СоответствиеРеквизитов.Вставить("Код", Объект.КодПервойСтраницы);
	СоответствияКодовНаСтранице.Вставить("ГруппаПерваяСтраница", СоответствиеРеквизитов);
	
	СоответствиеРеквизитов = Новый Структура;
	СоответствиеРеквизитов.Вставить("Реквизит", "КодПервойСтраницы");
	СоответствиеРеквизитов.Вставить("Код", Объект.КодВторойСтраницы);
	СоответствияКодовНаСтранице.Вставить("ГруппаВтораяСтраница", СоответствиеРеквизитов);
	
	Возврат СоответствияКодовНаСтранице;

КонецФункции

&НаСервере
Процедура конс_СохранитьКодИзКонсоли(ТекущийОбъект)

	Для Каждого Страница Из ЭтотОбъект.конс_СоответствияКодовНаСтранице Цикл
		СтруктураХранения = Страница.Значение;
		ТекущийОбъект[СтруктураХранения.Реквизит] = СтруктураХранения.Код;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура конс_ЗаполнитьПараметрыЗапросаНаСервере(Знач ТекстЗапроса)

	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	ВремПараметрыЗапроса = Схема.НайтиПараметры();
	Для Каждого ПараметрЗапроса Из ВремПараметрыЗапроса Цикл
		Если Объект.ПараметрыЗапроса.НайтиСтроки(Новый Структура("Имя", ПараметрЗапроса.Имя)).Количество() = 0 Тогда
			НоваяСтрока = Объект.ПараметрыЗапроса.Добавить();
			НоваяСтрока.Имя = ПараметрЗапроса.Имя;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура конс_ПравилоЗаполненияЗавершение(Результат, ДопПараметры) Экспорт

	конс_КомандыРедактораКлиент.ОчиститьТекст(ЭтотОбъект);
	конс_КомандыРедактораКлиент.УстановитьТекст(ЭтотОбъект, ДопПараметры.конс_КодДо, Неопределено, Ложь);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	ТекущиеДанные.КодЗначение = Результат;

КонецПроцедуры

&НаКлиенте
Процедура ОтрисовкаИзмененияВкладки(Знач АктивированнаяВкладка)

	ОтрисоватьИзменениеВкладки(АктивированнаяВкладка);
	
	Если АктивированнаяВкладка.Имя = "ДекорацияПерваяСтраница" Тогда
		АктивнаяСтраница = Элементы.ГруппаПерваяСтраница;
	ИначеЕсли АктивированнаяВкладка.Имя = "ДекорацияВтораяСтраница" Тогда
		АктивнаяСтраница = Элементы.ГруппаВтораяСтраница;
	Иначе
		АктивнаяСтраница = Элементы.ГруппаПерваяСтраница;
	КонецЕсли;
	
	конс_ВкладкаНажатие(АктивнаяСтраница);
	Элементы.ГруппаСтраницы.ТекущаяСтраница = АктивнаяСтраница;

КонецПроцедуры

&НаКлиенте
Процедура конс_НачальноеЗаполнение()

	КодПервойСтраницы = ЭтотОбъект.конс_СоответствияКодовНаСтранице[ЭтотОбъект.конс_КлючАктивнойСтраницы];
	конс_КомандыРедактораКлиент.УстановитьТекст(ЭтотОбъект, КодПервойСтраницы.Код, Неопределено, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОтрисоватьИзменениеВкладки(АктивированнаяВкладка)

	Для Каждого Декорация Из Элементы.ГруппаЭмуляцияВкладок.ПодчиненныеЭлементы Цикл
		Декорация.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Подчеркивание, 1);
	КонецЦикла;
	
	АктивированнаяВкладка.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Подчеркивание, 4);
	//@skip-check new-color
	АктивированнаяВкладка.ЦветРамки = Новый Цвет(51, 51, 51);

КонецПроцедуры

&НаКлиенте
Процедура конс_ПриСменеСтраницы()

	ЕстьКодНаСтранице = конс_ИнициализацияРедактораКлиент.ПриИзмененииВкладкиСКодом(ЭтотОбъект);
	
	конс_УстановитьВидимость(ЕстьКодНаСтранице);

КонецПроцедуры

&НаКлиенте
Процедура конс_ВкладкаНажатие(АктивированнаяВкладка)

	// ВстраиваниеКонсолиMonaco
	ЭтотОбъект.конс_КлючАктивированнойСтраницы = АктивированнаяВкладка.Имя;
	
	ЭтотОбъект.конс_ЭтоИзменениеСтраницы = Истина;
	конс_ПриСменеСтраницы();
	ЭтотОбъект.конс_ЭтоИзменениеСтраницы = Ложь;
	// Конец ВстраиваниеКонсолиMonaco

КонецПроцедуры

#КонецОбласти

