
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура конс_КаталогИсходниковНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог исходных файлов конфигурации";

	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПослеВыбораКаталога", ЭтотОбъект);     
    ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораКаталога(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		НаборКонстант.конс_КаталогИсходников = Результат[0];
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
