
#Область ПрограммныйИнтерфейс

// Управляет видимостью строки состояния
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Объект формы, содержащей элемент управления 'конс_Код'
Процедура УправлениеВидимостьюСтрокиСостояния(Форма) Экспорт

	Форма.Элементы.конс_СтрокаСостояния.Пометка = Форма.конс_ВидимостьСтрокиСостояния;
	
	Если Форма.конс_ВидимостьСтрокиСостояния Тогда
		View(Форма).showStatusBar();
	Иначе
		View(Форма).hideStatusBar();
	КонецЕсли;

КонецПроцедуры

// Устанавливает пометку на кнопку Быстрые подсказки
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Объект формы, содержащей элемент управления 'конс_Код'
Процедура УправлениеБыстрымиПодсказками(Форма) Экспорт

	Форма.Элементы.конс_БыстрыеПодсказки.Пометка = Форма.конс_БыстрыеПодсказки;

КонецПроцедуры

// Возвращает представление по умолчанию документа из элемента управления 'конс_Код' на форме
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Объект формы, содержащей элемент управления 'конс_Код'
// 
// Возвращаемое значение:
// Неопределено - Представление документа или Неопределено, если отсутствует
Функция View(Форма) Экспорт

	Возврат Форма.Элементы.конс_Код.Документ.defaultView;

КонецФункции

// Переключает состояние быстрых подсказок в форме и управляет их отображением
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Объект формы, для которой управляются быстрые подсказки
Процедура БыстрыеПодсказки(Форма) Экспорт

	Форма.конс_БыстрыеПодсказки = Не Форма.конс_БыстрыеПодсказки;
	View(Форма).enableQuickSuggestions(Форма.конс_БыстрыеПодсказки);
	УправлениеБыстрымиПодсказками(Форма);

КонецПроцедуры

// Вставляет новую строку с указанным текстом в форму на заданную позицию
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, в которую вставляется строка
//  НомерСтроки - Число  - Позиция (индекс) для вставки новой строки
//  Текст       - Строка - Текст, который будет вставлен в новую строку
Процедура ВставитьСтроку(Форма, НомерСтроки, Текст) Экспорт

	View(Форма).insertLine(НомерСтроки, Текст);

КонецПроцедуры

// Асинхронно вызывает конструктор запроса для формы с возможностью задания параметров и начального текста запроса
// 
// Параметры:
//  Форма           - ФормаКлиентскогоПриложения        - Объект формы, для которой вызывается конструктор запроса
//  ПараметрыВызова - Произвольный - Необязательные параметры вызова конструктора запроса
Асинх Процедура ВызватьКонструкторЗапроса(Форма, ПараметрыВызова = Неопределено) Экспорт

	ДанныеЗапроса = ДанныеДляКонструктораЗапроса(ПараметрыВызова, Форма);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Форма", Форма);
	ДопПараметры.Вставить("НачальнаяПозиция", ДанныеЗапроса.НачальнаяПозиция);
	ДопПараметры.Вставить("КонечнаяПозиция", ДанныеЗапроса.КонечнаяПозиция);
	ДопПараметры.Вставить("ТекстЗапроса", ДанныеЗапроса.ТекстЗапроса);
	
	ТекстЗапроса = ДопПараметры.ТекстЗапроса;
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Результат = Ждать ВопросАсинх("Не найден текст запроса." + Символы.ПС + "Создать новый запрос?", РежимДиалогаВопрос.ДаНет);
	
		Если Результат = КодВозвратаДиалога.Да Тогда
			ОткрытьКонструкторЗапроса("", ДопПараметры);
		КонецЕсли;
	Иначе
		ПодготовитьТекстЗапросаККонструкторуЗапросов(ТекстЗапроса, Форма);
		ОткрытьКонструкторЗапроса(ТекстЗапроса, ДопПараметры);
	КонецЕсли;

КонецПроцедуры

// Добавляет закладку для указанной строки в форме
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, в которой необходимо добавить закладку
//  НомерСтроки - Число        - Номер строки, для которой необходимо добавить закладку
// 
// Возвращаемое значение:
// Булево - Возвращает результат работы внутреннего метода View.addBookmark (возможно значение или объект закладки)
Функция ДобавитьЗакладку(Форма, НомерСтроки) Экспорт

	Возврат View(Форма).addBookmark(НомерСтроки);

КонецФункции

// Добавляет строку с указанным текстом в форму, используя внешний метод addLine
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, в которую добавляется строка
//  Текст - Строка         - Текст для добавляемой строки
Процедура ДобавитьСтроку(Форма, Текст) Экспорт

	View(Форма).addLine(Текст);

КонецПроцедуры

// Заменяет выделенный текст в указанной форме на новый текст
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения  - Объект формы, в которой нужно заменить выделенный текст
//  Текст - Строка - Новый текст для замены выделенного фрагмента
Процедура ЗаменитьВыделенныйТекст(Форма, Текст) Экспорт

	View(Форма).selectedText(Текст);

КонецПроцедуры

// Заменяет текст в документе по указанному диапазону номеров строк
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, в котором производится замена текста
//  ТекстЗапроса    - Строка         - Текст, который нужно вставить в указанный диапазон
//  НачальнаяСтрока - Число          - Номер начальной строки диапазона для замены
//  КонечнаяСтрока  - Число          - Номер конечной строки диапазона для замены
Процедура ЗаменитьТекстПоНомерамСтрок(Форма, ТекстЗапроса, НачальнаяСтрока, КонечнаяСтрока) Экспорт

	View(Форма).replaceTextInRange(ТекстЗапроса, НачальнаяСтрока, КонечнаяСтрока);

КонецПроцедуры

// Управляет отображением мини-карты (minimap) на форме. Отображает или скрывает мини-карту в зависимости от значения параметра Показать.
// 
// Параметры:
//  Форма    - ФормаКлиентскогоПриложения - Объект формы, для которой управляется отображение мини-карты
//  Показать - Булево - Флаг, определяющий видимость мини-карты (Истина - показать, Ложь - скрыть)
Процедура Миникарта(Форма, Показать) Экспорт

	View(Форма).minimap(Показать);

КонецПроцедуры

// Выполняет поиск указанного текста в форме
// 
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - Объект формы, в которой выполняется поиск
//  СтрокаПоиска - Строка - Текст для поиска в форме
Процедура НайтиТекст(Форма, СтрокаПоиска) Экспорт

	View(Форма).findText(СтрокаПоиска);

КонецПроцедуры

// Обновляет текст в указанной форме с возможностью очистки истории и принудительного обновления
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, в которой требуется обновить текст
//  Текст                    - Строка - Новый текст для отображения в форме
//  ОчиститьИсторию          - Булево - Флаг очистки истории (по умолчанию Истина)
//  ПринудительноеОбновление - Булево - Флаг принудительного обновления (по умолчанию Ложь)
Процедура ОбновитьТекст(Форма, Текст, ОчиститьИсторию = Истина, ПринудительноеОбновление = Ложь) Экспорт

	View(Форма).updateText(Текст, ОчиститьИсторию, ПринудительноеОбновление);

КонецПроцедуры

// Обрабатывает события редактора и выполняет соответствующие действия в зависимости от типа события
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма редактора
//  Событие - Структура - Объект события редактора с информацией о событии
Процедура ОбработатьСобытиеРедактора(Форма, Событие) Экспорт

	Если Событие <> Неопределено Тогда
	
		ИмяСобытия = Событие.event;
	
		Если ИмяСобытия = "EVENT_QUERY_CONSTRUCT" Тогда
	
			ВызватьКонструкторЗапроса(Форма, Событие.params);
		КонецЕсли;
	
		Если ИмяСобытия = "EVENT_FORMAT_CONSTRUCT" Тогда
			ВызватьКонструкторФорматнойСтроки(Форма, Событие.params);
		КонецЕсли;
	
		Если ИмяСобытия = "EVENT_CONTENT_CHANGED" Тогда
			Форма.Модифицированность = Истина;
		КонецЕсли;
	
		Если ИмяСобытия = "EVENT_GET_METADATA" Тогда
			конс_ИнициализацияРедактораКлиент.ОбработкаСобытияПолученияМетаданных(Форма, Событие.params);
		КонецЕсли;
	
		Если ИмяСобытия = "EVENT_ON_LINK_CLICK" Тогда
			Если 0 < СтрНайти(Событие.params.href, "e1cib") Тогда
				ПерейтиПоНавигационнойСсылке(Событие.params.href);
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

// Открывает виджет поиска на указанной форме
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, на которой открывается виджет поиска
Процедура ОткрытьВиджетПоиска(Форма) Экспорт

	View(Форма).openSearchWidget();

КонецПроцедуры

// Форматирует текст документа в указанной форме с возможностью принудительного обновления
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, содержащий текст для форматирования
//  ОбновитьПринудительно - Булево       - Флаг принудительного обновления форматирования (опционально, по умолчанию Ложь)
Процедура ОтформатироватьТекст(Форма, ОбновитьПринудительно = Ложь) Экспорт

	View(Форма).formatDocument(ОбновитьПринудительно);

КонецПроцедуры

// Очищает текст в представлении формы
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, содержащий представление для очистки текста
//  ПринудительноеОбновление - Булево - Флаг принудительного обновления представления после очистки
// 
// Возвращаемое значение:
// Булево - Результат выполнения операции очистки текста
Функция ОчиститьТекст(Форма, ПринудительноеОбновление = Ложь) Экспорт

	Возврат View(Форма).eraseText(ПринудительноеОбновление);

КонецФункции

// Перемещает курсор к парной скобке в редакторе кода 1С
// 
// Параметры:
//  Форма - Форма - Объект формы, в которой находится редактор кода
Процедура ПерейтиКПарнойСкобке(Форма) Экспорт

	View(Форма).jumpToBracket();

КонецПроцедуры

// Выполняет переход к строке в форме
// 
// Параметры:
//  Форма - Форма - Объект формы, к строке которой выполняется переход
Процедура ПерейтиКСтроке(Форма) Экспорт

	View(Форма).gotoLine();

КонецПроцедуры

// Переключает режим синтаксической подсветки для текста запроса в форме между режимами BSL и BSL Query
// 
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - Объект формы, содержащей текстовое поле для запроса
//  РежимЗапроса - Булево - Признак режима: Истина - BSL Query, Ложь - BSL
Процедура ПереключитьРежимЗапроса(Форма, РежимЗапроса) Экспорт

	ИдентификаторРежима = ?(РежимЗапроса, "bsl_query", "bsl");
	
	ТекстЗапроса = ПолучитьТекст(Форма);
	
	View(Форма).setLanguageMode(ИдентификаторРежима);
	
	View(Форма).updateText(ТекстЗапроса, Ложь, Истина);

КонецПроцедуры

// Переключает режим подсветки запросов в форме консоли и устанавливает соответствующую тему оформления
// 
// Параметры:
//  Форма - Форма - Объект формы консоли, для которой выполняется переключение подсветки запросов
Процедура ПодсвечиватьЗапросы(Форма) Экспорт

	Форма.конс_ПодсвечиватьЗапросы = Не Форма.конс_ПодсвечиватьЗапросы;
	Форма.Элементы.конс_ПодсвечиватьЗапросы.Пометка = Форма.конс_ПодсвечиватьЗапросы;
	ИмяТемы = ПолучитьТекущуюТему(Форма);
	ИмяТемы = ИмяТемы + ?(Форма.конс_ПодсвечиватьЗапросы, "-query", "");
	УстановитьТему(Форма, ИмяТемы);

КонецПроцедуры

// Показывает координаты текущего выделения на форме
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, для которой необходимо показать координаты выделения
Процедура ПоказатьКоординатыВыделения(Форма) Экспорт

	View(Форма).showSelectionCoordinates();

КонецПроцедуры

// Отображает номера строк в указанной форме
// 
// Параметры:
//  Форма - Форма - Объект формы, в которой необходимо показать номера строк
Процедура ПоказатьНомераСтрок(Форма) Экспорт

	View(Форма).showLineNumbers();

КонецПроцедуры

// Отображает справочную информацию для указанной формы
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, для которой необходимо показать справочную информацию
Процедура ПоказатьСправку(Форма) Экспорт

	View(Форма).showHelp();

КонецПроцедуры

// Перемещает прокрутку формы к указанной строке и отображает её в центре экрана
// 
// Параметры:
//  Форма       - Форма - Объект формы, в которой требуется показать строку
//  НомерСтроки - Число - Номер строки для отображения в центре
Процедура ПоказатьСтрокуВЦентре(Форма, НомерСтроки) Экспорт

	View(Форма).revealLineInCenter(НомерСтроки);

КонецПроцедуры

// Возвращает выделенный текст из указанной формы
// 
// Параметры:
//  Форма - Форма - Объект формы, из которой необходимо получить выделенный текст
// 
// Возвращаемое значение:
// Строка - Выделенный текст из формы
Функция ПолучитьВыделенныйТекст(Форма) Экспорт

	Возврат View(Форма).getSelectedText();

КонецФункции

// Возвращает координаты текущего выделения в форме
// 
// Параметры:
//  Форма - Форма - Объект формы, для которой необходимо получить координаты выделения
// 
// Возвращаемое значение:
// Неопределено - Координаты выделения в виде объекта
Функция ПолучитьКоординатыВыделения(Форма) Экспорт

	Возврат View(Форма).getSelectionCoordinates();

КонецФункции

// Возвращает номера выделенных строк в форме
// 
// Параметры:
//  Форма - Форма - Объект формы, в которой производится получение номеров выделенных строк
// 
// Возвращаемое значение:
// Массив из Число - Номера выделенных строк в форме
Функция ПолучитьНомераСтрокВыделения(Форма) Экспорт

	Возврат View(Форма).getSelectionLineNumbers();

КонецФункции

// Функция возвращает текстовое представление формы
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма для получения текстового представления
// 
// Возвращаемое значение:
// Строка - Текстовое представление формы
Функция ПолучитьТекст(Форма) Экспорт

	Код = View(Форма).getText();
	
	Возврат Код;

КонецФункции

// Возвращает текущую колонку в элементе формы
// 
// Параметры:
//  Форма - Форма - Элемент формы, для которого определяется текущая колонка
// 
// Возвращаемое значение:
// Число - Текущая колонка в элементе формы
Функция ПолучитьТекущуюКолонку(Форма) Экспорт

	Возврат View(Форма).getCurrentColumn();

КонецФункции

// Возвращает текущую строку формы для дальнейшей обработки или отображения
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, для которого требуется получить текущую строку
// 
// Возвращаемое значение:
// Число - Текущая строка формы
Функция ПолучитьТекущуюСтроку(Форма) Экспорт

	Возврат View(Форма).getCurrentLine();

КонецФункции

// Сбрасывает позицию кнопки помощи в форме на значение по умолчанию
// 
// Параметры:
//  Форма - Форма - Объект формы, в которой требуется сбросить положение кнопки помощи
Процедура СброситьПозициюКнопкиПомощи(Форма) Экспорт

	View(Форма).resetHelpButtonPosition();

КонецПроцедуры

// Скрывает номера строк в указанной форме
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, в которой необходимо скрыть номера строк
Процедура СкрытьНомераСтрок(Форма) Экспорт

	View(Форма).hideLineNumbers();

КонецПроцедуры

// Скрывает панель справки в указанной форме
// 
// Параметры:
//  Форма - Форма - Объект формы, в которой необходимо скрыть справку
Процедура СкрытьСправку(Форма) Экспорт

	View(Форма).hideHelp();

КонецПроцедуры

// Переключает видимость строки состояния и обновляет ее состояние в форме
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, в которой управляется видимость строки состояния
Процедура СтрокаСостояния(Форма) Экспорт

	Форма.конс_ВидимостьСтрокиСостояния = Не Форма.конс_ВидимостьСтрокиСостояния;
	УправлениеВидимостьюСтрокиСостояния(Форма);

КонецПроцедуры

// Устанавливает режим только для чтения для формы и управляет возможностью редактирования
// 
// Параметры:
//  Форма - Форма - Объект формы, для которой устанавливается режим только для чтения
Процедура ТолькоДляЧтения(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Форма.конс_ТолькоДляЧтения = Не Форма.конс_ТолькоДляЧтения;
	Элементы.конс_ТолькоДляЧтения.Пометка = Не Форма.конс_ТолькоДляЧтения;
	Элементы.конс_КонструкторЗапроса.Доступность = Не Форма.конс_ТолькоДляЧтения;
	
	View(Форма).setReadOnly(Форма.конс_ТолькоДляЧтения);

КонецПроцедуры

// Удаляет закладку в форме по указанному номеру строки
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, в которой находится закладка
//  НомерСтроки - Число  - Номер строки закладки для удаления
Процедура УдалитьЗакладку(Форма, НомерСтроки) Экспорт

	View(Форма).removeBookmark(НомерСтроки);

КонецПроцедуры

// Устанавливает выделение ячеек на форме в указанном диапазоне
// 
// Параметры:
//  Форма            - Форма - Объект формы, на которой устанавливается выделение
//  НачальнаяСтрока  - Число - Номер начальной строки диапазона выделения
//  НачальнаяКолонка - Число - Номер начальной колонки диапазона выделения
//  КонечнаяСтрока   - Число - Номер конечной строки диапазона выделения
//  КонечнаяКолонка  - Число - Номер конечной колонки диапазона выделения
Процедура УстановитьВыделение(Форма, НачальнаяСтрока, НачальнаяКолонка, КонечнаяСтрока, КонечнаяКолонка) Экспорт

	View(Форма).setSelection(НачальнаяСтрока, НачальнаяКолонка, КонечнаяСтрока, КонечнаяКолонка);

КонецПроцедуры

// Устанавливает маркеры на форме путем вызова метода setMarkers у представления формы
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, на которую нужно установить маркеры
//  МаркерыJSON - Строка - Данные маркеров в формате JSON для установки на форме
Процедура УстановитьМаркеры(Форма, МаркерыJSON) Экспорт

	View(Форма).setMarkers(МаркерыJSON);

КонецПроцедуры

// Устанавливает режим только для чтения для указанной формы
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, для которой устанавливается режим
//  ТолькоДляЧтения - Булево - Флаг установки режима только для чтения (Истина - включить, Ложь - выключить)
Процедура УстановитьРежимТолькоДляЧтения(Форма, ТолькоДляЧтения) Экспорт

	View(Форма).setReadOnly(ТолькоДляЧтения);

КонецПроцедуры

// Устанавливает текст в указанной позиции формы с учетом отступа первой строки и принудительного обновления при необходимости
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, в которую добавляется текст
//  Текст                       - Строка - Текст для установки в форме
//  Позиция                     - Число  - Позиция в тексте для установки
//  УчитыватьОтступПервойСтроки - Булево - Определяет, следует ли учитывать отступ первой строки при установке текста
//  ПринудительноеОбновление    - Булево - Определяет необходимость принудительного обновления формы (необязательный, по умолчанию Ложь)
Процедура УстановитьТекст(Форма, Текст, Позиция, УчитыватьОтступПервойСтроки, ПринудительноеОбновление = Ложь) Экспорт

	View(Форма).setText(Текст, Позиция, УчитыватьОтступПервойСтроки, ПринудительноеОбновление);

КонецПроцедуры

// Устанавливает тему оформления для указанной формы
// 
// Параметры:
//  Форма   - ФормаКлиентскогоПриложения - Объект формы, для которой устанавливается тема
//  ИмяТемы - Строка - Название темы оформления
Процедура УстановитьТему(Форма, ИмяТемы) Экспорт

	View(Форма).setTheme(ИмяТемы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Асинх Процедура ВызватьКонструкторФорматнойСтроки(Форма, ПараметрыСтроки)

	Если ПараметрыСтроки = Неопределено Тогда
		ТекстВопроса = "Форматная строка не найдена." + Символы.ПС + "Создать новую форматную строку?";
		Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
		Если Результат <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	
		ФорматнаяСтрока = "";
		Позиция = Неопределено;
	Иначе
		ФорматнаяСтрока = СтрЗаменить(СтрЗаменить(ПараметрыСтроки.text, "|", ""), """", "");
		Позиция = ПараметрыСтроки.range;
	КонецЕсли;
	
	Конструктор = Новый КонструкторФорматнойСтроки;
	Попытка
		Конструктор.Текст = ФорматнаяСтрока;
	Исключение
		Инфо = ИнформацияОбОшибке();
		ПоказатьПредупреждение( , "Ошибка в тексте форматной строки:" + Символы.ПС + Инфо.Причина.Описание);
		Возврат;
	КонецПопытки;
	
	ФорматнаяСтрока = Ждать Конструктор.ПоказатьАсинх();
	
	Если ФорматнаяСтрока <> Неопределено Тогда
		ФорматнаяСтрока = СтрЗаменить(ФорматнаяСтрока, "'", "");
		ФорматнаяСтрока = """" + ФорматнаяСтрока + """";
		УстановитьТекст(Форма, ФорматнаяСтрока, Позиция, Ложь);
	КонецЕсли;

КонецПроцедуры

Функция ДанныеДляКонструктораЗапроса(Знач ПараметрыВызова, Знач Форма)

	ТекстЗапроса = "";
	НачальнаяПозиция = 0;
	КонечнаяПозиция = 0;
	Если ПараметрыВызова = Неопределено Тогда
	
		Если View(Форма).queryMode Тогда
			ТекстЗапроса = ПолучитьТекст(Форма);
		Иначе
			// Попытаемся извлечь текст запроса из выделенного текста
			ТекстЗапроса = ПолучитьВыделенныйТекст(Форма);
	
			Строки = ПолучитьНомераСтрокВыделения(Форма);
			НачальнаяПозиция = Строки.startLine;
			КонечнаяПозиция = Строки.endLine;
		КонецЕсли;
	
	Иначе
		НачальнаяПозиция = ПараметрыВызова.range.startLineNumber;
		КонечнаяПозиция = ПараметрыВызова.range.endLineNumber;
		ТекстЗапроса = ПараметрыВызова.text;
	КонецЕсли;
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("НачальнаяПозиция", НачальнаяПозиция);
	ДанныеЗапроса.Вставить("КонечнаяПозиция", КонечнаяПозиция);
	ДанныеЗапроса.Вставить("ТекстЗапроса", ТекстЗапроса);
	
	Возврат ДанныеЗапроса;

КонецФункции

Асинх Процедура ОткрытьКонструкторЗапроса(ТекстЗапроса, ДопПараметры)

	Попытка
		Конструктор = Новый КонструкторЗапроса(ТекстЗапроса);
	Исключение
		Инфо = ИнформацияОбОшибке();
		ПоказатьПредупреждение( , "Ошибка в тексте запроса:" + Символы.ПС + Инфо.Причина.Описание);
		Возврат;
	КонецПопытки;
	
	ТекстЗапроса = Ждать Конструктор.ОткрытьАсинх();
	
	УстановитьТекстЗапроса(ТекстЗапроса, ДопПараметры);

КонецПроцедуры

Процедура ПодготовитьТекстЗапросаККонструкторуЗапросов(ТекстЗапроса, Форма)

	Если Не View(Форма).queryMode Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "|", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """""", "$");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$", """");
	КонецЕсли;

КонецПроцедуры

Процедура ПодготовитьТекстЗапросаКРедакторуКода(ТекстЗапроса, Форма)

	Если Не View(Форма).queryMode Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Символы.ПС, Символы.ПС + "|");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """", """""");
		ТекстЗапроса = """" + ТекстЗапроса + """";
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТекущуюТему(Форма)

	Возврат View(Форма).getTheme();

КонецФункции

Процедура УстановитьТекстЗапроса(ТекстЗапроса, Знач ДопПараметры)

	Форма = ДопПараметры.Форма;
	
	Если ТекстЗапроса <> Неопределено Тогда
	
		Если View(Форма).queryMode Тогда
			ОчиститьТекст(Форма);
			УстановитьТекст(Форма, ТекстЗапроса, Неопределено, Истина);
		Иначе
			ПодготовитьТекстЗапросаКРедакторуКода(ТекстЗапроса, Форма);
			ЗаменитьТекстПоНомерамСтрок(Форма, ТекстЗапроса, ДопПараметры.НачальнаяПозиция,
				ДопПараметры.КонечнаяПозиция);
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

